Repository: sergkrumas/image_viewer
Catalog: locales/*/LC_MESSAGES/*.po
Languages: ru

source: ➜ BOARD PAGE left mouse click - select picture items & rectangle select middle mouse click - camera moving mouse wheel - camera zooming F12 - activate/desactivate gamepad control Playstation 4 Dualshock Gamepad & ShanWan Gamepad supported left stick - camera moving right stick (vertical) - camera zooming X gamepad button - the left and right sticks exchange/exchange back for Playstation 4 Dualshock
ru: ➜ СТРАНИЦА BOARD левая кнопка мыши - выделить картинки & выделить картинки прямоугольником зажатие средней кнопки мыши/колеса - перемещение камеры колесо мыши - зум камеры F12 - включить/выключить управление с геймпада поддерживаются геймпады Playstation 4 Dualshock & ShanWan Gamepad левый стик - перемещение камеры правый стик (вертикальная ось) - зум камеры кнопка X на геймпаде - поменять левый и правый стики ролями. При повторном нажатии возвращает всё обратно

source: Multifolder board...
ru: Собрать доску из содержимого нескольких папок...

source: Choose Directories
ru: Выбор папок

source: No folders selected!
ru: Папки не выбраны!

source: Loading images to the board
ru: Загрузка изображений на доску

source: Gamepad dead zone radius
ru: Радиус мёртвой зоны геймпада (для неисправных стиков)

source: Show gamepad monitor (for setting dead zone radius)
ru: Показывать монитор геймпада (для задания радиуса мёртвой зоны)

source: Fit factor for small images
ru: Степень увеличения мелких изображений

source: Diagonal factor for one-key selected items scaling (in screen pixels)
ru: Шаг масштабирования выделенных айтемов по диагонали (в пикселях) для клавиш нампада: *, / и -

source: No active item!
ru: Не определён активный айтем!

source: Preview corner radius: {0}
ru: Радиус скругления углов у превьюшек: {0}

source: You've set 0 columns, so the number of columns depends only on the window width.
ru: Задано НОЛЬ столбцов, значит их число будет определятся автоматически по ширине окна.

source: You've set {0} columns. This is the maximum!
ru: Задано {0} столбцов. Больше выставить нельзя!

source: You've set {0} columns
ru: Задано {0} столбцов

source: Cursor scrubbing mode activated
ru: Прокрутка с помощью курсора активирована

source: Cursor scrubbing mode disactivated
ru: Дезактивирована прокрутка с помощью курсора

source: Show FPS
ru: Показать количество кадров в секунду (FPS)

source: Rounded previews
ru: Скруглённые превьюшки

source: No plugins found
ru: Board-плагины не найдены

source: Load Plugins...
ru: Загрузить board-плагины...

source: Cursor scrubbing optimizer
ru: Оптимизация отрисовки для прокрутки с помощью курсора

source: Reset item(s) to layout position, scale, rotation
ru: Выставить начальные позицию, масштаб и ориентацию для айтема

source: No images found in selected folders!
ru: Поддерживаемых изображений не найдено в выбранных папках!

source: Desaturated corner buttons and corner menus
ru: Обесцветить угловые кнопки и угловые меню

source: Open application on Waterfall page
ru: Открывать приложение на странице Waterfall

source: Gamepad move stick easeInExpro parameter
ru: Параметр плавности начальной скорости перемещения по доске

source: Gamepad move stick speed
ru: Скорость перемещения по доске для геймпада

source: Draw shadow and checkerboard backplate
ru: Рисовать тень и шахматный узор под изображением

source: Library page
ru: Страница LIBRARY

source: Library page rounded corner radius
ru: Радиус скругления для страницы LIBRARY

source: Waterfall page
ru: Страница WATERFALL

source: Desired number of Waterfall page columns
ru: Желаемое кол-во столбцов в сетке на странице WATERFALL

source: Waterfall page grid spacing
ru: Расстояние между превьюшками в сетке на странице WATERFALL

source: Waterfall page rounded corner radius
ru: Радиус скругления для страницы WATERFALL

source: Load board plugins at startup
ru: Загружать board-планигы на старте приложения

source: Vertical items layout
ru: Располагать айтемы вертикально, а не горизонтально

source: Waterfall page transparent value
ru: Прозрачность страницы WATERFALL

source: Open folder "{0}" in separate app instance
ru: Открыть папку "{0}" в копии приложения

source: Cursor scrubbing for animation files
ru: Перематывание курсором мыши для анимированных изображений

source: Show window frame
ru: Показать рамку окна

source: Hide window frame and maximize
ru: Скрыть рамку окна и максимально развернуть окно

source: Leave full-screen mode
ru: Выйти из полноэкранного режима

source: Go full screen
ru: Перейти в полноэкранный режим

source: Switch the window to the monitor on the right
ru: Перенести окно приложения на монитор справа

source: Switch the window to the monitor on the left
ru: Перенести окно приложения на монитор слева

source: Next grayscale filter state
ru: Переключить фильтр отображения на следующий режим

source: Edit comment text {0}
ru: Редактировать текст комента {0}

source: Redefine comment borders {0}
ru: Переопределить границы комента {0}

source: Delete comment {0}
ru: Удалить комент {0}

source: Hide this menu
ru: Скрыть это меню

source: prettify plots
ru: намарафетить графики

source: DEBUG tools...
ru: Дебаг-тулзы

source: Message the developer
ru: Написать разработчику

source: Always on top
ru: Поверх всех окон

source: Disable "Always on top"
ru: Отключить "Поверх всех окон"

source: Line EyeDropper Tool...
ru: Пипетка-растяжка...

source: Сontrol with a gamepad
ru: Управление с геймпада

source: Line EyeDropper tool is not activated!
ru: Пипетка-растяжка не активирована!

source: Line EyeDropper disactivated!
ru: Пипетка-растяжка выключена!

source: Update the plots
ru: Обновить графики

source: Exit the tool mode
ru: Выйти из режима пипетки-растяжки

source: Increase the plots width
ru: Увеличить площадь графиков

source: Place the plots using mouse cursor...
ru: Разместить графики на новом месте с помощью курсора мыши

source: Make two left-clicks to begin
ru: Чтобы начать, надо сделать два клика левой кнопкой в разных местах

source: Use the context menu of the plots
ru: Не забывайте пользоваться контекстным меню графиков
