Repository: sergkrumas/image_viewer
Catalog: locales/*/LC_MESSAGES/*.po
Languages: ru

source: Unable to open file, first open Google Chrome browser!
ru: Невозможно выполнить команду, сначала надо запустить браузер Google Chrome!

source: Error
ru: Ошибка

source: Unable to display
ru: Невозможно отобразить

source: The file is corrupted
ru: Файл повреждён

source: No images
ru: Нет изображений

source: The file is not supported
ru: Этот файл не поддерживается

source: LOADING
ru: ЗАГРУЗКА

source: broken file
ru: файл повреждён

source: Loading
ru: Загрузка

source: DRAG AND DROP A FILE OR A FOLDER
ru: ПЕРЕТАЩИ СЮДА ФАЙЛ ИЛИ ПАПКУ С ФАЙЛАМИ

source: or left mouse click to open Explorer dialog.
ru: или кликни левой кнопкой мыши, чтобы открыть диалог.

source: Right mouse click to open settings window.
ru: Клик правой кнопкой — открыть окно настроек.

source: [the program is running in lite mode]
ru: [программа запущена в лайтовом (упрощённом) режиме]

source: [the program is running in standard mode]
ru: [программа запущена в обычном режиме]

source: The program is running under 32-bit Python interpreter, so the memory limit is 1.5GB which is not enough. Once the limit will be reached, the program deadly freezes. Use 64-bit Python interpreter to avoid this kind of issues.
ru: Программа была запущена из 32bit-го интерпретатора Python, из-за чего сейчас имеет ограничение по потребляемой памяти до 1.5GB и рискует зависнуть при подходе значения потребляемой памяти к 1.5GB. Для увеличения доступной памяти надо запуститься из 64bit-го интерпретатора.

source: Please wait
ru: Подождите

source: speed
ru: скорость

source: frame
ru: кадр

source: viewing history
ru: история просмотра

source: Abort! Animation effects disabled in settings
ru: Отмена! Анимационные эффекты отключены в настройках

source: Unable to save: no source file or source file is not found
ru: Невозможно сохранить: отсутствует исходный файл или исходный файл не найден на диске

source: The folder path is not set or the folder path doesn't exist
ru: Путь к папке не задан или сама заданная папка не найдена на диске

source: The image is saved in file
ru: Изображение сохранено в файл

source: Choose folder to put images in
ru: Выберите папку, в которую будут складываться картинки

source: Save file
ru: Сохранить файл

source: Abort! Feature is not implemented yet for animated images
ru: Отмена! Фича пока не реализована для анимированных изображений

source: pasted!
ru: вставлено!

source: Minimize
ru: Свернуть

source: DEBUG
ru: ОТЛАДКА

source: Antialiasing and pixmap smoothing
ru: Антиальясинг и сглаживание пиксмапов

source: Use pixmap-proxy for text items
ru: Pixmap-прокси для пометок типа «Текст»

source: Make program crash intentionally (for dev purposes only)...
ru: Крашнуть приложение (для дебага)...

source: Settings...
ru: Настройки...

source: Narrow window back to monitor frame
ru: Вернуть окно в монитор

source: Expand window to two monitors frame
ru: Развернуть окно на два монитора

source: Restart app in standard mode
ru: Перезапустить в обычном режиме

source: Restart app (to purge unused data in memory)
ru: Перезапуск (для сброса лишней памяти)

source: Open in separate app instance
ru: Открыть в отдельной копии приложения

source: Open unsupported file...
ru: Открыть неподдерживаемый файл...

source: Copy metadata to clipboard
ru: Скопировать метаданные в буфер обмена

source: Find on disk
ru: Найти на диске

source: Open in Google Chrome
ru: Открыть в Google Chrome

source: Place image in window center
ru: Вернуть картинку в центр окна

source: Change SVG rasterization resolution...
ru: Изменить разрешение растеризации SVG-файла...

source: Save .png file...
ru: Сохранить в .png...

source: Save .jpg file...
ru: Сохранить в .jpg...

source: Copy to clipboard
ru: Копировать в буфер обмена

source: Paste from clipboard
ru: Вставить из буфера обмена

source: Switch from fovorites folder to actual image folder
ru: Перейти из избранного в папку с этим изображением

source: Now redefine comment borders by pressing Ctrl+Shift+LMB
ru: Теперь переопределите границы комментария через Ctrl+Shift+LMB

source: Question
ru: Вопрос

source: No running app instance at the moment. Start app in lite mode?
ru: Не обнаружено запущенной копии приложения. Запуститься в лайтовом (упрощённом) режиме?

source: Choose folder with pictures in it
ru: Выбери папку с пикчами

source: Error-error
ru: Ошибочка

source: Nothing to show, exit...
ru: Ну раз ничего не выбрал, то я закрываюсь. Пака...

source: Memory allocated
ru: Выделенная память

source: Purge unused objects
ru: Удалить ненужные объекты из памяти

source: Neither the image nor the folder it is in don't exist
ru: Ни изображение, ни папка, в которой оно находится, не существуют

source: Crash info save to file {0}
ru: Информация о краше сохранена в файл {0}

source: Application crash! {0} Restart app?
ru: Программа аварийно завершила работу! {0} Перезапустить приложение?

source: Fatal Error!
ru: Это фиаско, мои чюваки!

source: [variable self.debug_file_io_filepath is not set!]
ru: [переменная self.debug_file_io_filepath не задана!]

source: request processing
ru: обработка запроса

source: plugin {0} is not found in \boards_plugins folder!
ru: плагин {0} не найден в папке \boards_plugins!

source: {0} activated
ru: {0} активировано

source: You're on viewer page now
ru: Теперь ты на странице вьювера

source: No files, only folders supported
ru: Файлы не поддерживаются, поддерживаются только папки

source: Plugin Boards
ru: Доски-плагины

source: Change frame item label
ru: Изменить название айтема-фрейма

source: Label Text:
ru: Название:

source: Show debug graphics for transformation widget
ru: Отображать отладочную графику для виджета трансформации

source: Go to the link in the note (Explorer or Browser)
ru: Пройти по ссылке в заметке (Проводник или веб-браузер)

source: Folder...
ru: Папка...

source: Group
ru: Группа

source: {0} (add selected items to it: {1})
ru: {0} (добавить в группу выделенные элементы: {1})

source: Frame
ru: Фрейм

source: Note
ru: Заметка

source: Force highres loading of all items right now (may take some time)
ru: Загрузить хайрезные версии всем айтемам (может занять время)

source: Place items in column
ru: Разместить айтемы вертикально

source: Change frame title '{0}'
ru: Изменить название фрейма '{0}'

source: Take current image from group and place nearby
ru: Вынуть текущую картинку из группы

source: Open in viewer in separated app copy running in lite mode
ru: Открыть на странице вьювера в копии приложения в упрощённом режиме

source: {0} Virtual Folder
ru: {0} Виртуальная Папка

source: Board loading
ru: Загрузка доски

source: Board saving
ru: Сохранение доски

source: Board File (*.board)
ru: Файл доски (*.board)

source: Error: either the file does not exist or the extension is wrong. Abort! {0}
ru: Ошибка: либо файла не существует, либо расширение не то. Отмена! {0}

source: Reading error: neither cbor2 nor json could be read. Abort!
ru: Ошибка чтения: ни cbor2, ни json не читается. Отмена!

source: Board has been loaded from file {0} of format {1}
ru: Доска загружена из файла {0} формата {1}

source: Project is saved to {0}
ru: Проект сохранён сюда {0}

source: You cannot dive inside item when board operation is not finished!
ru: Нельзя погружаться если операция с доской не завершена!

source: You can dive inside groups, folders and animated items only!
ru: Нырять можно только в группы, папки и анимированные картинки!

source: ANIMATED FILE Virtual Folder
ru: Анимированного файла Виртуальная Папка

source: Place cursor above a group item!
ru: Наведи курсор на группу!

source: No place to return
ru: Некуда возвращаться

source: WELCOME TO BOARDS
ru: ДОБРО ПОЖАЛОВАТЬ НА СТРАНИЦУ ДОСОК

source: WAITING
ru: ПОДОЖДИ

source: creating previews
ru: создаются превьюшки

source: perfomance status: {0} images drawn
ru: изображений отображается {0}

source: Virtual folder board: {}
ru: Доска виртуальной папки: {}

source: Board folder: {}
ru: Папка доски {}

source: File-plugin name: {}
ru: Имя файла-плагина: {}

source: This board has no plugin attached
ru: У этой доски нет прикреплённого плагина

source: Current item index: {}
ru: Индекс текущего айтема: {}

source: Current item-group index: {}
ru: Индекс текущего айтема-группы: {}

source: Board bounding rect: {}
ru: Габаритный прямоугольник всех айтемов доски: {}

source: You've entered this board from the board of folder {}
ru: В эту доску вошли из доски папки {}

source: Parent folder of this board {}
ru: Родительская папка этой доски {}

source: This board parent item title {}
ru: Название родительского айтема для этой доски {}

source: Pressing Backspace key returns to board of the folder {0}
ru: Клавиша Антипробел (другие названия: забой/бэкспейс) вернёт на доску папки {0}

source: Add to the group ({})
ru: Добавить в группу ({})

source: AXES
ru: НАЧАЛО

source: ORIGIN
ru: КООРДИНАТ

source: The camera has been moved
ru: Камера перемещена на указанную позицию

source: Out of the map frame!
ru: Клик вне карты!

source: Loading hires images
ru: Загрузка изображений в высоком качестве

source: You cannot delete items from animated file board
ru: Нельзя удалять айтемы из доски анимированного файла

source: GROUP Virtual Folder
ru: Группы Виртуальная Папка

source: Nothing to delete, the group is empty
ru: Нечего удалять, группа пуста

source: Group-item not found
ru: Айтем-группа не найдена

source: You cannot create group-item inside virtual folder board
ru: Нельзя создавать айтемы-группы внутри доски виртуальной папки

source: You cannot create note-item inside virtual folder board
ru: Нельзя создавать айтемы-заметки внутри доски виртуальной папки

source: Choose folder with images in it
ru: Выбери папку с пикчами в ней

source: Loading folder to the board
ru: Загрузка папки на доску

source: No items selected!
ru: Не выделеного ни одного айтема!

source: FRAME ITEM
ru: АЙТЕМ-ФРЕЙМ

source: Loading image to the board
ru: Загрузка изображения на доску

source: This element is not presented on the board
ru: Этот элемент не представлен на доске

source: No items on the board! Abort!
ru: На доске нет айтемов! Отмена!

source: <b>Select Color<b>
ru: <b>Выбери цвет<b>

source: Errors occured during reading the file {0}
ru: Ошибки во время чтения файла {0}

source: Commented images
ru: С комментариями

source: Comment removing
ru: Удаление коментария

source: Comment "{0}". Delete it?
ru: Комент "{0}". Удалить его?

source: Comments is not supposed to be edited and viewed when app is running in lite mode
ru: Комментарии нельзя задавать и просматривать в упрощённом режиме

source: Created: {0}
ru: Создан: {0}

source: Edited: {0}
ru: Изменён: {0}

source: Comment editing
ru: Редактирование комента

source: Save
ru: Сохранить

source: Close
ru: Закрыть

source: No images to show
ru: Нет изображений для показа

source: This feature is not working in lite mode Rerun programm in standart mode via context menu command
ru: В упрощённом режиме функция не работает! Перезапустите программу в обычном режиме через команду контекстного меню

source: Added to favorites
ru: Добавлено в избранное

source: Removed from favorites
ru: Удалено из избранного

source: Files with such extensions are not allowed to be added to favorites!
ru: Файлы с таким расширением нельзя добавлять в избранное!

source: Virtual folders are not allowed to be updated!
ru: Виртуальные папки не обновляются!

source: Updated
ru: Обновлено

source: Favorites
ru: Избранное

source: Image zoom out
ru: Уменьшить

source: Image zoom in
ru: Увеличить

source: Help
ru: Справка

source: Settings
ru: Настройки

source: Show previous
ru: Предыдущее

source: Slideshow
ru: Запустить слайдшоу

source: Show next
ru: Следующее

source: Rotate counterclockwise
ru: Повернуть против часовой стрелки

source: Rotate clockwise
ru: Повернуть по часовой стрелке

source: Update files list
ru: Обновить список

source: board page
ru: страница Board

source: Include subfolers when updating files list and scanning on openning
ru: Включить подпапки при обновлении списка файлов и при сканировании на этапе открытия папки

source: Original order
ru: Исхдоный порядок

source: Sort by filename (descending)
ru: Сортировать по имени (по убыванию)

source: Sort by filename (ascending)
ru: Сортировать по имени (по возрастанию)

source: Sort by creation date (descending)
ru: Сортировать по дате создания (по убыванию)

source: Sort by creation date (ascending)
ru: Сортировать по дате создания (по возрастанию)

source: Save order metadata to disk
ru: Сохранить порядок изображений на диск

source: Show control panel in full-screen mode
ru: Отобразить панель во весь экран

source: ➜ FOR ALL PAGES Esc - exit program Tab - switch between pages in cyclic order ~ - show/hide settings window P - toggle window state between normal and always-on-top Ctrl+ →/← - move full-screen window from one monitor to another
ru: ➜ ДЛЯ ВСЕХ СТРАНИЦ Esc - Закрытие программы Tab - Переход из вьювера на страницу библиотеки и обратно Ё - Показать/скрыть настройки P - Включает и выключает отображение окна поверх всех окон Ctrl+ →/← перенос полноэкранного окна между доступными мониторами

source: ➜ VIEWER PAGE ↑ - image zoom in ↓ - image zoom out → - show next image ← - show previous image Space - pause/resume for animated images W, A, S, D - image move Home - show first image in current folder End - show last image in currend folder Shift+Tab - switch to next folder in library Y - toggle between window and full-screen mode T - show/hide tags form D - show/hide thirds F - add to/remove from favorites C - show/hide image center point Ctrl + LMB - zoom in to user-defined region and sets magnifier mode - Esc - disable magnifier mode I - invert image colors R - grab window canvas with default image scale - as magnifier mode is enabled saves user-defined region of window canvas + Shift - take viewport scale instead default image scale M - mirror image horizontally + Ctrl - vertically Alt + →/← - navigate through viewing history
ru: ➜ СТРАНИЦА VIEWER ↑ - Увеличение масштаба текущей картинки ↓ - Уменьшение масштаба текущей картинки → - Показать следующую картинку ← - Показать прыдыдущую картинку Пробел - Пауза/воспроизведение анимированных .gif- и .webp-файлов W, A, S, D - Клавиши перемещения в прострастве картинки вверх, влево, вниз и вправо соответственно Home - Переключение на первую картинку в списке текущей папки End - Переключение на последнюю картинку в списке текущей папки Shift+Tab - Переключение на следующую по порядку папку в библиотеке Y - Переключение между оконным и полноэкранным режимом T - Показать/скрыть форму тегов D - Показать/скрыть трети F - Добавить в избранное или удалить из избранного C - Показать/скрыть центральную точку Ctrl + ЛКМ - Увеличить заданную курсором область и войти в режим лупы - Esc - выйти из режима лупы I - Инвертировать цвета у картинки R - Сохранить содержимое окна в масштабе исходной картинки - в режиме выделения сохраняет содержимое рамки выделения + Shift - вместо масштаба исходной картинки будет задан масштаб окна M - Отразить картинку по горизонтальной оси + Ctrl - по вертикали Alt + →/← - Навигация по истории просмотра

source: ➜ LIBRARY PAGE ↑ - choose previous folder in the library list ↓ - choose next folder in library list Shift+Tab - switch to next folder in the library list Delete - delete folder from current session U - update image list for the current folder
ru: ➜ СТРАНИЦА LIBRARY ↑ - Выбор предыдущей папки в библиотеке ↓ - Выбор следующей папки в библиотеке Shift+Tab - Переключение на следующую по порядку папку в библиотеке Delete - Удаляет текущую папку из сессии U - Обновить список изображений для текущей папки

source: ➜ START PAGE not set
ru: ➜ СТРАНИЦА START не прописано

source: Gamepad control activated!
ru: Активировано управление от геймпада!

source: Gamepad not found!
ru: Геймпад не обнаружен!

source: Gamepad control deactivated!
ru: Деактивировано управление от геймпада!

source: Reading error. Feels like the gamepad is off
ru: Ошибка чтения. Скорее всего, геймпад отключён

source: Deleting images from virtual folders is not allowed
ru: Из виртуальных папок нельзя удалять изображения

source: File {0} removed to recycle bin
ru: Файл {0} удалён в корзину

source: You're not allowed to delete this!
ru: Это не удалить!

source: you've reached the end of the viewing history
ru: достигнут конец истории просмотра

source: You cannot delete virtual folders from the library
ru: Нельзя удалять виртуальные папки из библиотеки

source: OnAppStart virtual folder
ru: Стартовая виртуальная папка

source: No interesting files to show in {0}
ru: Нет изображений для показа в папке {0}

source: Thumbnails order saved to disk
ru: Порядок изображений сохранён на диск

source: No images in group
ru: В группе нет изображений

source: Find outdated records in database
ru: Поиск файлов в неактуальных записях

source: Define outdate database records
ru: Определить неактуальные записи

source: Try to fix outdated records
ru: Попытаться актуализировать записи

source: No outdated records detected!
ru: Не найдено неактуальных записей!

source: Comments database updated!
ru: База данных коментов обновлена!

source: Favorites database updated!
ru: База данных избранного обновлена!

source: Tags database updated!
ru: База данных тегов обновлена!

source: Scanning is finished.
ru: Сканирование завершено.

source: Outdated records in comments database ({0}):
ru: Файлы из неактуальных записей коментов ({0}):

source: Outdated records in favorites database ({0}):
ru: Файлы из неактуальных записей избранного ({0}):

source: Outdated records in tags database ({0}):
ru: Файлы из неактуальных записей тегов ({0}):

source: English
ru: Английский

source: Russian
ru: Русский

source: German
ru: Немецкий

source: French
ru: Французский

source: Italian
ru: Итальянский

source: Spanish
ru: Испанский

source: General
ru: Общее

source: Run on Windows Startup
ru: Запускать приложение при старте Windows

source: Supress start dialog and run lite mode
ru: Запускать лайтовый (упрощённый) режим сразу, то есть без диалога

source: Full-screen mode on application start
ru: Открываться в полноэкранном режиме

source: Toggle between full-screen and window mode via double click
ru: Переключение между оконным и полноэкранным режимом через двойной клик

source: Hide to tray on close
ru: Прятаться в трей при закрытии окна

source: Hide to tray on app start
ru: Прятать окно в трей на старте

source: Show standard (console) output overlay
ru: Показывать консольный вывод поверх контента

source: Animated effects
ru: Анимационные эффекты

source: Show animated cells overlay
ru: Показывать анимированнные ячейки поверх всего

source: Viewer page
ru: Страница VIEWER

source: Animated zoom
ru: Анимированный зум изображения

source: Draw backplate for control panel
ru: Монотонная подложка под панель миниатюр и кнопок

source: Thumbnails size
ru: Размер миниатюр в панели управления вьювера

source: Enable mouse wheel to zoom and Ctrl+mouse wheel to navigate through image list
ru: Зум с помощью колёсика мыши (для навигации по списку изображений удерживать Ctrl)

source: Show dummy-default thumbnail while generated one is not ready
ru: Рисовать дефолтную мелкую превьюшку, пока не сгенерировалась настоящая

source: Show thirds
ru: Показывать трети

source: Cyberpunk frame
ru: Кибирпунк

source: Show image center
ru: Показывать центр изображения точкой

source: Show random secret when approaching high zoom level
ru: Показывать рандомную вселенскую истину при сильном увеличении

source: Autohide control panel
ru: Автоматически скрывать панель миниатюр и кнопок

source: Enable global viewing history instead per-folder one
ru: Выключить историю просмотра для каждой папки отдельно и включить глобальную

source: Show image metadata
ru: Показывать метаданные изображения

source: Autosave thumbnails order to disk on reordering ones
ru: Автоматически сохранять в файл задаваемый порядок изображений через панель миниатюр

source: Allow browsing image filetypes only
ru: Показывать только изображения

source: Board page
ru: Страница BOARD

source: Show origin compass and zoom level
ru: Показывать компас и уровень зума камеры

source: Show board origin
ru: Показывать координаты начала осей доски

source: Show board grid
ru: Показывать сетку

source: Do unloading for images not shown in the viewer at the momoment
ru: Оперативно выгружать картинки, если они не просматриваются в данный момент

source: Focus board viewport on the current image when board is first time opened
ru: При первом открытии доски из вьювера центрировать вьюпорт доски на текущей картинке

source: Scaling and rotating activation-spot size
ru: Размер зон активации скейла или вращения

source: Enable CBOR2 instead JSON for writing board data
ru: Использовать CBOR2 вместо JSON для записи данных досок

source: Pages transparent setting for full-screen mode
ru: Прозрачность страниц при отображении в полноэкранном режиме

source: Viewer page transparent value
ru: Прозрачность страницы VIEWER

source: Library page transparent value
ru: Прозрачность страницы LIBRARY

source: Board page transparent value
ru: Прозрачность страницы BOARD

source: Start page transparent value
ru: Прозрачность страницы START

source: Slideshow for Viewer page
ru: Слайдшоу на странице VIEWER

source: Transition duration in seconds
ru: Длительность анимации перехода в секундах

source: Delay duration in seconds
ru: Длительность удержания изображения в секундах

source: Paths
ru: Пути

source: Folder to put framed images in (could be changed in dialog by pressing Ctrl+R)
ru: Папка для сохранения кадрированных картинок (изменяется только через Ctrl+R вне окна настроек)

source: Save and close
ru: Сохранить и закрыть

source: Plot scale factor is {0}x
ru: Горизонтальный масштаб графика {0}x

source: Color {0} has been copied to clipboard!
ru: Значение цвета {0} скопировано в буфер обмена!

source: Distance is too short!
ru: Расстояние слишком короткое!

source: show red
ru: показывать красный

source: show green
ru: показывать зелёный

source: show blue
ru: показывать синий

source: show hue
ru: показывать тон

source: show saturation
ru: показывать насыщение

source: show lightness
ru: показывать светлость

source: Tags are not supposed to be used when app is running in lite mode!
ru: Теги нельзя юзать в упрощённом режиме!

source: Image tags
ru: Тэги изображения

source: (No description for the tag)
ru: (Нет описания для этого тэга)

source: Show image
ru: Показать изображение

source: Edit tag description
ru: Редактировать описание тега

source: Delete tag "{0}" and its metadata
ru: Удалить тэг "{0}" и его метаданные

source: Cancel
ru: Отмена

source: Delete (no confirmation)
ru: Удалить (подтверждение не требуется)

source: Restart app to take effect across the entire app!
ru: Перезапустите приложение, чтобы новый язык активировался!

source: UI language
ru: Язык интерфейса

source: The left and right sticks exchange
ru: Левый и правый стики поменялись ролями

source: The left and right sticks exchange back
ru: Левый и правый стики поменялись ролями обратно
