


help_info = """
➜ ДЛЯ ВСЕХ РЕЖИМОВ
    Esc - Закрытие программы
    Tab - Переход из режима просмотра в режим библиотеки и обратно
    Ё - Показать/скрыть настройки
    P - Включает и выключат режим Поверх всех окон
    Ctrl+ →/← перенос полноэкранного окна между доступными мониторами

➜ РЕЖИМ ВЬЮВЕРА
    ↑ - Увеличение масштаба текущей картинки
    ↓ - Уменьшение масштаба текущей картинки
    → - Показать следующую картинку
    ← - Показать прыдыдущую картинку
    Пробел - Пауза/воспроизведение анимированных .gif- и .webp-файлов
    W, A, S, D - Клавиши перемещения в прострастве картинки вверх, влево, вниз и вправо соответственно
    Home - Переключение на первую картинку в списке текущей папки
    End - Переключение на последнюю картинку в списке текущей папки
    Shift+Tab - Переключение на следующую по порядку папку в библиотеке
    Y - Переключение между оконным и полноэкранными режимами
    T - Показать/скрыть трети
    F - Добавить в избранное или удалить из избранного
    C - Показать/скрыть центральную точку
    Ctrl + ЛКМ - Увеличить заданную курсором область и войти в этот режим (Esc - отмена)
    I - Инвертировать цвета у картинки
    R - Сохранить содержимое окна в масштабе исходной картинки
           - в режиме выделения сохраняет содержимое рамки выделения
           + Shift - вместо масштаба исходной картинки будет задан масштаб окна
    M - Отразить картинку по горизонтальной оси
    Alt + →/← - Навигация по истории просмотра

➜ РЕЖИМ БИБЛИОТЕКИ
    ↑ - Выбор предыдущей папки в библиотеке
    ↓ - Выбор следующей папки в библиотеке
    Shift+Tab - Переключение на следующую по порядку папку в библиотеке
    Delete - Удаляет текущую папку из сессии
    U - Обновить список изображений для текущей папки
➜ РЕЖИМ PUREREF
    В разработке
"""
